lib/affirm/testing_support/fixtures.http/refund/partially_refund_success.http

HTTP/1.1 200 OK
Cache-Control: private, no-cache, no-store, must-revalidate
Connection: keep-alive
Content-Encoding: gzip
Content-Type: application/json
Date: Mon, 13 Apr 2020 12:51:28 GMT
Server: openresty
Set-Cookie: tracker_device=203bfdca-13f3-4a5c-b198-d5abe346c7b0; Domain=.affirm.com; Expires=Wed, 13-Apr-2022 12:51:28 GMT; Max-Age=63072000; Secure; Path=/; SameSite=None
Set-Cookie: 3060738.3440491=203bfdca-13f3-4a5c-b198-d5abe346c7b0; Domain=.affirm.com; Expires=Wed, 13-Apr-2022 12:51:28 GMT; Max-Age=63072000; Secure; Path=/; SameSite=None
Set-Cookie: session=eyJjb250ZXh0X2FyaSI6IlMzWVEtWjRWMSJ9.EXXx0A.UbQ2XsXC4G5HRNQDmfYMKqM2ea8; Secure; HttpOnly; Path=/; SameSite=None
Strict-Transport-Security: max-age=86400
Transfer-Encoding: chunked
Vary: Accept-Encoding
X-Affirm-Request-Id: 78a79cfc-70e8-4ef9-ce61-2d9ec92b5d6c

{
    "amount": 25000,
    "created": "2020-04-13T12:51:28Z",
    "currency": "USD",
    "fee_refunded": 0,
    "id": "J4TBOU2ZXVGB7IHJ",
    "type": "refund"
}
